src/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьEmail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Контрагенты/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	Ответственный = ПараметрыСеанса.СотрудникТекущегоПользователя;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.СотрудникТекущегоПользователя;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//ЭтоЮридическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	//	
	//Если ЮридическоеФизическоеЛицо = ЭтоЮридическоеЛицо Тогда
	//	ПроверкаИННИКППЮрЛица(Отказ);
	//Иначе
	//	ПроверкаИННИКППФизЛица(Отказ);
	//КонецЕсли;

КонецПроцедуры

Процедура ПроверкаИННИКППФизЛица(Отказ)
	
	ДлинаИНН = СтрДлина(ИНН);
	
	Если ЗначениеЗаполнено(КПП) Тогда 
		Сообщить("У физического лица КПП должно быть пустым!");
		Отказ = Истина;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(ИНН) ИЛИ ДлинаИНН <> 12 Тогда
		Сообщить("У физического лица ИНН должно быть заполнено и иметь 12 символов!");
		Отказ = Истина;
	КонецЕсли;    
	
	МассивЗапрещенныхСимволов = Новый Массив;
	
	Для Счетчик = 1 По ДлинаИНН Цикл
	
		СимволСтроки = Сред(ИНН, Счетчик, 1);
		КодСимволаСтроки = КодСимвола(СимволСтроки);
		
		Если КодСимволаСтроки < 48 ИЛИ КодСимволаСтроки > 57 Тогда 
			МассивЗапрещенныхСимволов.Добавить(СимволСтроки);
		КонецЕсли;
	
	КонецЦикла;
	
	Если МассивЗапрещенныхСимволов.Количество() > 0 Тогда 
		Сообщить("У физического лица ИНН не должно иметь запрещенные символы!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры 

Процедура ПроверкаИННИКППЮрЛица(Отказ)
	
	ДлинаИНН = СтрДлина(ИНН);
	ДлинаКПП = СтрДлина(КПП);
	
	Если Не ЗначениеЗаполнено(КПП) ИЛИ СтрДлина(КПП) <> 9 Тогда 
		Сообщить("У юридического лица КПП должен быть заполнен, и иметь длину 9 символов!");
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИНН) ИЛИ СтрДлина(ИНН)<> 10 Тогда 
		Сообщить("У юридического лица ИНН должно иметь 10 символов!");
		Отказ = Истина;
	КонецЕсли;
	
	МассивЗапрещенныхСимволов = Новый Массив;
	
	Для Счетчик = 1 По ДлинаИНН Цикл
		СимволСтроки = Сред(ИНН, Счетчик, 1);
		КодСимволаСтроки = КодСимвола(СимволСтроки);
		
		Если КодСимволаСтроки < 48 ИЛИ КодСимволаСтроки > 57 Тогда 
			МассивЗапрещенныхСимволов.Добавить(СимволСтроки);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивЗапрещенныхСимволов.Количество() > 0 Тогда 
		Сообщить("У юридического лица ИНН не должно иметь запрещенные символы!");
		Отказ = Истина; 
		МассивЗапрещенныхСимволов.Очистить();
	КонецЕсли;
	
	Для Счетчик = 1 По ДлинаКПП Цикл
		СимволСтроки = Сред(КПП, Счетчик, 1);
		КодСимволаСтроки = КодСимвола(СимволСтроки);
		
		Если КодСимволаСтроки < 48 ИЛИ КодСимволаСтроки > 57 Тогда 
			МассивЗапрещенныхСимволов.Добавить(СимволСтроки);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивЗапрещенныхСимволов.Количество() > 0 Тогда 
		Сообщить("У юридического лица КПП не должно иметь запрещенные символы!");
		Отказ = Истина; 
	КонецЕсли; 
	
	Если Не РаботаСИННКлиентСервер.ИННВерен(ИНН) Тогда
		Сообщить("Контрольные соотношения не верны!");
		Отказ = Истина; 
	КонецЕсли; 

	
КонецПроцедуры
